n, m = map(int, input().split())
arr = []

I1 = [(0,0), (0,1), (0,2), (0,3)]
I2 = [(0,0), (1,0), (2,0), (3,0)]
O = [(0,0), (0,1), (1,0), (1,1)]
T1 = [(0,0), (0,1), (0,2), (1,1)]  # ┴ 모양
T2 = [(0,1), (1,0), (1,1), (1,2)]  # ┬ 모양
T3 = [(0,1), (1,0), (1,1), (2,1)]  # ┤ 모양
T4 = [(0,0), (1,0), (1,1), (2,0)]  # ├ 모양
L1 = [(0,0), (1,0), (2,0), (2,1)]  # └ 모양
L2 = [(0,0), (0,1), (0,2), (1,0)]  # ┌ 모양 (시계 90° 회전)
L3 = [(0,0), (0,1), (1,1), (2,1)]  # ┐ 모양 (180° 회전)
L4 = [(0,2), (1,0), (1,1), (1,2)]  # ┘ 모양 (270° 회전)
J1 = [(0,1), (1,1), (2,1), (2,0)]  # ┘의 대칭, 즉 좌측 아래가 돌출
J2 = [(0,0), (1,0), (1,1), (1,2)]  # ┐의 대칭
J3 = [(0,0), (0,1), (1,0), (2,0)]  # └의 대칭
J4 = [(0,0), (0,1), (0,2), (1,2)]  # ┌의 대칭
S1 = [(0,0), (0,1), (1,1), (1,2)]
S2 = [(0,1), (1,0), (1,1), (2,0)]  # S를 90° 회전한 모양
Z1 = [(0,1), (0,2), (1,0), (1,1)]
Z2 = [(0,0), (1,0), (1,1), (2,1)]  # Z를 90° 회전한 모양


for i in range(n):
    inputs = list(map(int, input().split()))
    arr.append(inputs)

answer = 0
for row in range(n):
    for col in range(m):
        for block_position in [I1, I2, O, T1, T2, T3, T4, L1, L2, L3, L4, J1, J2, J3, J4, S1, S2, Z1, Z2]:
            temp = 0
            for y, x in block_position:
                new_row = row + y
                new_col = col + x
                if 0 <= new_row < n and 0 <= new_col < m:
                    temp += arr[new_row][new_col]
                else:
                    temp = -1
                    break
            answer = max(answer, temp)

print(answer)